In [2]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.2-cp310-cp310-win_amd64.whl (11.6 MB)
     ---------------------------------------- 11.6/11.6 MB 1.5 MB/s eta 0:00:00
Collecting pytz>=2020.1
  Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
     ------------------------------------ 505.5/505.5 KB 275.6 kB/s eta 0:00:00
Requirement already satisfied: numpy>=1.22.4 in c:\users\abhinav\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.26.4)
Collecting tzdata>=2022.7
  Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
     ------------------------------------ 345.4/345.4 KB 930.9 kB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\abhinav\appdata\roaming\python\python310\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\abhinav\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 24.0 is available.
You should consider upgrading via the 'c:\Users\ABHINAV\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [8]:
import pandas as pd
# mydict={"car":["alto","ritz","swift"],
#         "price":["one","two","three"]}
# print(mydict)
# df=pd.DataFrame(mydict)
# print(df)

{'car': ['alto', 'ritz', 'swift'], 'price': ['one', 'two', 'three']}
     car  price
0   alto    one
1   ritz    two
2  swift  three

In [11]:
# dict={"name":["akhil","akash","akshay"],"mark":[30,40,50],"grade":["c","b","a"]}
# print(dict)
# nm=pd.DataFrame(dict)
# print(nm)

{'name': ['akhil', 'akash', 'akshay'], 'mark': [30, 40, 50], 'grade': ['c', 'b', 'a']}
     name  mark grade
0   akhil    30     c
1   akash    40     b
2  akshay    50     a

In [14]:
# lt=[1,2,3,4]
# a=pd.Series(lt,index=["a","b","v","c"])
# print(a)

a    1
b    2
v    3
c    4
dtype: int64

In [18]:
# calories=[100,200,300,400]
# inp=pd.Series(calories,index=["day1","day2","day3","day4"])
# print(inp)

day1    100
dtype: int64

In [19]:
# print(nm)

     name  mark grade
0   akhil    30     c
1   akash    40     b
2  akshay    50     a

In [20]:
# nm.to_csv('data.csv',index=False)

In [32]:
#converting data set to csv file
# zz={"name":["gireesh","suresh","ramesh"],"age":[43,55,47],"weight":[70,67,88]}
# print(zz)
# yy=pd.DataFrame(zz)
# print(yy)
# yy.to_csv('data1.csv',index=True)

{'name': ['gireesh', 'suresh', 'ramesh'], 'age': [43, 55, 47], 'weight': [70, 67, 88]}
      name  age  weight
0  gireesh   43      70
1   suresh   55      67
2   ramesh   47      88

In [25]:
#find square root and mean
# import pandas as pd
# details={"name":["adarsh","amal","athul","akshay"],"age":[29,28,27,30],"place":["mankavu","puthiyara","kallai","kinassery"]}
# print(details)
# mm=pd.DataFrame(details)
# print(mm)

# import numpy as np
# mm['sqrt']=np.sqrt(mm["age"])
# print(mm)
# mm['mean']=np.mean(mm["age"])
# print(mm)

{'name': ['adarsh', 'amal', 'athul', 'akshay'], 'age': [29, 28, 27, 30], 'place': ['mankavu', 'puthiyara', 'kallai', 'kinassery']}
     name  age      place
0  adarsh   29    mankavu
1    amal   28  puthiyara
2   athul   27     kallai
3  akshay   30  kinassery
     name  age      place      sqrt
0  adarsh   29    mankavu  5.385165
1    amal   28  puthiyara  5.291503
2   athul   27     kallai  5.196152
3  akshay   30  kinassery  5.477226
     name  age      place      sqrt  mean
0  adarsh   29    mankavu  5.385165  28.5
1    amal   28  puthiyara  5.291503  28.5
2   athul   27     kallai  5.196152  28.5
3  akshay   30  kinassery  5.477226  28.5

In [21]:
#find sqaure
# details={"name":["adarsh","amal","athul","akshay"],"age":[29,28,27,30],"place":["mankavu","puthiyara","kallai","kinassery"]}
# print(details)
# mm['square']=np.square(mm["age"])
# print(mm)

{'name': ['adarsh', 'amal', 'athul', 'akshay'], 'age': [29, 28, 27, 30], 'place': ['mankavu', 'puthiyara', 'kallai', 'kinassery']}
     name  age      place      sqrt  mean  square  sum
0  adarsh   29    mankavu  5.385165  28.5     841   29
1    amal   28  puthiyara  5.291503  28.5     784   57
2   athul   27     kallai  5.196152  28.5     729   84
3  akshay   30  kinassery  5.477226  28.5     900  114

In [22]:
#find maximum
# details={"name":["adarsh","amal","athul","akshay"],"age":[29,28,27,30],"place":["mankavu","puthiyara","kallai","kinassery"]}
# print(details)
# aa=np.max(mm["age"])
# print(aa)

{'name': ['adarsh', 'amal', 'athul', 'akshay'], 'age': [29, 28, 27, 30], 'place': ['mankavu', 'puthiyara', 'kallai', 'kinassery']}
30

In [23]:
#find cumulative sum
# details={"name":["adarsh","amal","athul","akshay"],"age":[29,28,27,30],"place":["mankavu","puthiyara","kallai","kinassery"]}
# print(details)
# mm['sum']=np.cumsum(mm["age"])
# print(mm)

{'name': ['adarsh', 'amal', 'athul', 'akshay'], 'age': [29, 28, 27, 30], 'place': ['mankavu', 'puthiyara', 'kallai', 'kinassery']}
     name  age      place      sqrt  mean  square  sum
0  adarsh   29    mankavu  5.385165  28.5     841   29
1    amal   28  puthiyara  5.291503  28.5     784   57
2   athul   27     kallai  5.196152  28.5     729   84
3  akshay   30  kinassery  5.477226  28.5     900  114

In [32]:
#describe function
# details={"name":["adarsh","amal","athul","akshay"],"age":[29,28,27,30],"place":["mankavu","puthiyara","kallai","kinassery"]}
# print(details)
# pp=pd.DataFrame(details)
# print(pp)
# hh=pp.describe()
# print(hh)

{'name': ['adarsh', 'amal', 'athul', 'akshay'], 'age': [29, 28, 27, 30], 'place': ['mankavu', 'puthiyara', 'kallai', 'kinassery']}
     name  age      place
0  adarsh   29    mankavu
1    amal   28  puthiyara
2   athul   27     kallai
3  akshay   30  kinassery
             age
count   4.000000
mean   28.500000
std     1.290994
min    27.000000
25%    27.750000
50%    28.500000
75%    29.250000
max    30.000000

In [7]:
import numpy as np
import pandas as pd
# dt={"name":["jithin","nithin","vishnu","vipin","arun","sooraj"],"subject":["english","malayalam","physics","chemistry","maths","biology"],"mark":[23,np.nan,30,28,np.nan,35]}
# print(dt)
# kk=pd.DataFrame(dt)
# print(kk)
# jj=kk["mark"].fillna(26)
# jj
# kk.fillna(26,inplace=True)
# kk

{'name': ['jithin', 'nithin', 'vishnu', 'vipin', 'arun', 'sooraj'], 'subject': ['english', 'malayalam', 'physics', 'chemistry', 'maths', 'biology'], 'mark': [23, nan, 30, 28, nan, 35]}
     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam   NaN
2  vishnu    physics  30.0
3   vipin  chemistry  28.0
4    arun      maths   NaN
5  sooraj    biology  35.0

     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam  26.0
2  vishnu    physics  30.0
3   vipin  chemistry  28.0
4    arun      maths  26.0
5  sooraj    biology  35.0

In [13]:
# result={"name":["jithin","nithin","vishnu","vipin","arun","sooraj"],"subject":["english","malayalam","physics","chemistry","maths","biology"],"mark":[23,np.nan,30,28,np.nan,35]}
# print(result)
# df=pd.DataFrame(result)
# print(df)
# x=np.mean(df["mark"])
# print(df)
# df.fillna(x,inplace=True)
# df

{'name': ['jithin', 'nithin', 'vishnu', 'vipin', 'arun', 'sooraj'], 'subject': ['english', 'malayalam', 'physics', 'chemistry', 'maths', 'biology'], 'mark': [23, nan, 30, 28, nan, 35]}
     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam   NaN
2  vishnu    physics  30.0
3   vipin  chemistry  28.0
4    arun      maths   NaN
5  sooraj    biology  35.0
     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam   NaN
2  vishnu    physics  30.0
3   vipin  chemistry  28.0
4    arun      maths   NaN
5  sooraj    biology  35.0

     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam  29.0
2  vishnu    physics  30.0
3   vipin  chemistry  28.0
4    arun      maths  29.0
5  sooraj    biology  35.0

In [22]:
# rt={"name":["jithin","nithin","vishnu","vipin","arun","sooraj"],"subject":["english","malayalam","physics","chemistry","maths","biology"],"mark":[23,np.nan,30,28,np.nan,35]}
# print(rt)
# df=pd.DataFrame(rt)
# print(df)
# y=df["median"]=df["mark"].median()
# print(df)
# df.fillna(y,inplace=True)
# df

{'name': ['jithin', 'nithin', 'vishnu', 'vipin', 'arun', 'sooraj'], 'subject': ['english', 'malayalam', 'physics', 'chemistry', 'maths', 'biology'], 'mark': [23, nan, 30, 28, nan, 35]}
     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam   NaN
2  vishnu    physics  30.0
3   vipin  chemistry  28.0
4    arun      maths   NaN
5  sooraj    biology  35.0
     name    subject  mark  median
0  jithin    english  23.0    29.0
1  nithin  malayalam   NaN    29.0
2  vishnu    physics  30.0    29.0
3   vipin  chemistry  28.0    29.0
4    arun      maths   NaN    29.0
5  sooraj    biology  35.0    29.0

     name    subject  mark  median
0  jithin    english  23.0    29.0
1  nithin  malayalam  29.0    29.0
2  vishnu    physics  30.0    29.0
3   vipin  chemistry  28.0    29.0
4    arun      maths  29.0    29.0
5  sooraj    biology  35.0    29.0

In [24]:
# mt={"name":["jithin","nithin","vishnu","vipin","arun","sooraj"],"subject":["english","malayalam","physics","chemistry","maths","biology"],"mark":[23,np.nan,30,28,np.nan,35]}
# print(mt)
# df=pd.DataFrame(mt)
# print(df)
# df=df.rename(columns={"subject":"syllabus"})
# df

{'name': ['jithin', 'nithin', 'vishnu', 'vipin', 'arun', 'sooraj'], 'subject': ['english', 'malayalam', 'physics', 'chemistry', 'maths', 'biology'], 'mark': [23, nan, 30, 28, nan, 35]}
     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam   NaN
2  vishnu    physics  30.0
3   vipin  chemistry  28.0
4    arun      maths   NaN
5  sooraj    biology  35.0

     name   syllabus  mark
0  jithin    english  23.0
1  nithin  malayalam   NaN
2  vishnu    physics  30.0
3   vipin  chemistry  28.0
4    arun      maths   NaN
5  sooraj    biology  35.0

In [35]:
# py={"name":["jithin","nithin","vishnu","jithin","vipin","arun","sooraj"],"subject":["english","malayalam","physics","english","chemistry","maths","biology"],"mark":[23,np.nan,30,23,28,np.nan,35]}
# print(py)
# df=pd.DataFrame(py)
# df.drop_duplicates()

{'name': ['jithin', 'nithin', 'vishnu', 'jithin', 'vipin', 'arun', 'sooraj'], 'subject': ['english', 'malayalam', 'physics', 'english', 'chemistry', 'maths', 'biology'], 'mark': [23, nan, 30, 23, 28, nan, 35]}

     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam   NaN
2  vishnu    physics  30.0
4   vipin  chemistry  28.0
5    arun      maths   NaN
6  sooraj    biology  35.0

In [41]:
# bh={"name":["jithin","nithin","vishnu","jithin","vipin","arun","sooraj"],"subject":["english","malayalam","physics","english","chemistry","maths","biology"],"mark":[23,np.nan,30,23,28,np.nan,35]}
# print(bh)
# df=pd.DataFrame(bh)
# print(df)
# df.to_csv('sample.csv',index=True)

{'name': ['jithin', 'nithin', 'vishnu', 'jithin', 'vipin', 'arun', 'sooraj'], 'subject': ['english', 'malayalam', 'physics', 'english', 'chemistry', 'maths', 'biology'], 'mark': [23, nan, 30, 23, 28, nan, 35]}
     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam   NaN
2  vishnu    physics  30.0
3  jithin    english  23.0
4   vipin  chemistry  28.0
5    arun      maths   NaN
6  sooraj    biology  35.0

In [54]:
tt={"name":["jithin","nithin","vishnu","jithin","vipin","arun","sooraj"],"subject":["english","malayalam","physics","english","chemistry","maths","biology"],"mark":[23,np.nan,30,23,28,np.nan,35]}
print(tt)
df=pd.DataFrame(tt)
print(df)
df.to_excel('sample1.xlsx',index=True)

{'name': ['jithin', 'nithin', 'vishnu', 'jithin', 'vipin', 'arun', 'sooraj'], 'subject': ['english', 'malayalam', 'physics', 'english', 'chemistry', 'maths', 'biology'], 'mark': [23, nan, 30, 23, 28, nan, 35]}
     name    subject  mark
0  jithin    english  23.0
1  nithin  malayalam   NaN
2  vishnu    physics  30.0
3  jithin    english  23.0
4   vipin  chemistry  28.0
5    arun      maths   NaN
6  sooraj    biology  35.0

In [53]:
pip install openpyxl

Collecting openpyxlNote: you may need to restart the kernel to use updated packages.

  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ------------------------------------ 250.0/250.0 KB 163.3 kB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

WARNING: You are using pip version 22.0.4; however, version 24.0 is available.
You should consider upgrading via the 'c:\Users\ABHINAV\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [62]:
df=pd.read_csv('sample.csv')
df
#head and tail function
nm=df.tail(1)
nm
hj=df.head(1)
hj

   Unnamed: 0    name  subject  mark
0           0  jithin  english  23.0

In [75]:
print(df[["subject","mark","name"]])

     subject  mark    name
0    english  23.0  jithin
1  malayalam   NaN  nithin
2    physics  30.0  vishnu
3    english  23.0  jithin
4  chemistry  28.0   vipin
5      maths   NaN    arun
6    biology  35.0  sooraj

In [85]:
print(df[df["mark"]>25])

   Unnamed: 0    name    subject  mark
2           2  vishnu    physics  30.0
4           4   vipin  chemistry  28.0
6           6  sooraj    biology  35.0

In [91]:
# rq={"name":["jithin","athira","vishnu","aswathi","vipin","arun","sooraj"],"subject":["english","malayalam","physics","english","chemistry","maths","biology"],"mark":[23,np.nan,30,23,28,np.nan,35]}
# print(rq)
# df=pd.DataFrame(rq)
# print(df)
# df["gender"]=["male","female","male","female","male","male","male"]
# df

{'name': ['jithin', 'athira', 'vishnu', 'aswathi', 'vipin', 'arun', 'sooraj'], 'subject': ['english', 'malayalam', 'physics', 'english', 'chemistry', 'maths', 'biology'], 'mark': [23, nan, 30, 23, 28, nan, 35]}
      name    subject  mark
0   jithin    english  23.0
1   athira  malayalam   NaN
2   vishnu    physics  30.0
3  aswathi    english  23.0
4    vipin  chemistry  28.0
5     arun      maths   NaN
6   sooraj    biology  35.0

      name    subject  mark  gender
0   jithin    english  23.0    male
1   athira  malayalam   NaN  female
2   vishnu    physics  30.0    male
3  aswathi    english  23.0  female
4    vipin  chemistry  28.0    male
5     arun      maths   NaN    male
6   sooraj    biology  35.0    male

In [16]:
import numpy as np
import pandas as pd
rslt={"name":["jithin","athira","vishnu","aswathi","vipin","arun","sooraj","athul","adarsh"],"subject":["english","malayalam","physics","hindi","chemistry","maths","biology","social science","it"],"mark":[23,np.nan,30,23,28,np.nan,35,27,31]}
print(rslt)
df=pd.DataFrame(rslt)
print(df)
df.to_csv('sample6.csv',index="true")
pd.read_csv("sample6.csv")

{'name': ['jithin', 'athira', 'vishnu', 'aswathi', 'vipin', 'arun', 'sooraj', 'athul', 'adarsh'], 'subject': ['english', 'malayalam', 'physics', 'hindi', 'chemistry', 'maths', 'biology', 'social science', 'it'], 'mark': [23, nan, 30, 23, 28, nan, 35, 27, 31]}
      name         subject  mark
0   jithin         english  23.0
1   athira       malayalam   NaN
2   vishnu         physics  30.0
3  aswathi           hindi  23.0
4    vipin       chemistry  28.0
5     arun           maths   NaN
6   sooraj         biology  35.0
7    athul  social science  27.0
8   adarsh              it  31.0

   Unnamed: 0     name         subject  mark
0           0   jithin         english  23.0
1           1   athira       malayalam   NaN
2           2   vishnu         physics  30.0
3           3  aswathi           hindi  23.0
4           4    vipin       chemistry  28.0
5           5     arun           maths   NaN
6           6   sooraj         biology  35.0
7           7    athul  social science  27.0
8           8   adarsh              it  31.0

In [19]:
xx=np.mean(df["mark"])
print(xx)
df.fillna(xx,inplace=True)
df

28.142857142857142

      name         subject       mark
0   jithin         english  23.000000
1   athira       malayalam  28.142857
2   vishnu         physics  30.000000
3  aswathi           hindi  23.000000
4    vipin       chemistry  28.000000
5     arun           maths  28.142857
6   sooraj         biology  35.000000
7    athul  social science  27.000000
8   adarsh              it  31.000000

In [23]:
xx=np.mean(df["mark"])
print(xx)
df.fillna(xx,inplace=True)
df
df['sum']=np.cumsum(df["mark"])
df

28.142857142857142

      name         subject       mark       square         sum
0   jithin         english  23.000000   529.000000   23.000000
1   athira       malayalam  28.142857   792.020408   51.142857
2   vishnu         physics  30.000000   900.000000   81.142857
3  aswathi           hindi  23.000000   529.000000  104.142857
4    vipin       chemistry  28.000000   784.000000  132.142857
5     arun           maths  28.142857   792.020408  160.285714
6   sooraj         biology  35.000000  1225.000000  195.285714
7    athul  social science  27.000000   729.000000  222.285714
8   adarsh              it  31.000000   961.000000  253.285714

In [24]:
xx=np.mean(df["mark"])
print(xx)
df.fillna(xx,inplace=True)
df
df['sum']=np.cumsum(df["mark"])
df

28.142857142857142

      name         subject       mark       square         sum
0   jithin         english  23.000000   529.000000   23.000000
1   athira       malayalam  28.142857   792.020408   51.142857
2   vishnu         physics  30.000000   900.000000   81.142857
3  aswathi           hindi  23.000000   529.000000  104.142857
4    vipin       chemistry  28.000000   784.000000  132.142857
5     arun           maths  28.142857   792.020408  160.285714
6   sooraj         biology  35.000000  1225.000000  195.285714
7    athul  social science  27.000000   729.000000  222.285714
8   adarsh              it  31.000000   961.000000  253.285714

In [32]:
print(df[df["mark"]>30])

     name  subject  mark  square         sum
6  sooraj  biology  35.0  1225.0  195.285714
8  adarsh       it  31.0   961.0  253.285714

     name  subject  mark  square         sum
6  sooraj  biology  35.0  1225.0  195.285714
8  adarsh       it  31.0   961.0  253.285714